rubenmuehlhans/floor-heating-ctrl/apps/heatsource/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Flash und Partitionen: zwei OTA-Slots auf 4 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Groesse vor Geschwindigkeit - das Flash-Budget ist knapp
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# WLAN
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# Kein Bluetooth: die Fuehler haengen am 1-Wire-Bus. Damit entfallen auch die
# Koexistenz-Bausteine; zusammen rund 125 kB Programmspeicher und der beim
# Start belegte Halden-Anteil des BLE-Steuerwerks.
CONFIG_BT_ENABLED=n

# Drei Zeitserver
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# HTTP-Server fuer die Oberflaeche
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# Aufraeumen beim Neustart nach OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Das Geraet am Pufferspeicher fragt gleichzeitig mehrere Nachbarn ab -- je
# Verteiler den Bedarf, das Nachbargeraet die Messstellen, dazu die Relais der
# Pumpen. Jede dieser Verbindungen belegt einen Socket, und ein Relais, das
# nicht antwortet, haelt ihn bis zur Zeitgrenze. Mit den zehn Sockets der
# Vorgabe blieb fuer den Webserver zeitweise keiner uebrig: Die Antwort brach
# dann mitten in den Kopfzeilen ab.
CONFIG_LWIP_MAX_SOCKETS=16

# Kurzlebige HTTP-Verbindungen: Jede geschlossene Verbindung belegt danach noch
# TCP_MSL lang einen Verwaltungsblock. Bei 16 Bloecken und einer Minute Haltezeit
# sind sie unter Last aufgebraucht, und neue Verbindungen werden zwar auf
# TCP-Ebene angenommen, aber nie bedient -- der Aufrufer wartet ins Leere.
# Mehr Bloecke und eine kurze Haltezeit; ein Heimnetz braucht die volle
# Wartezeit nicht, sie schuetzt vor verspaeteten Paketen aus dem Internet.
CONFIG_LWIP_MAX_ACTIVE_TCP=32
CONFIG_LWIP_TCP_MSL=5000
